name: Microsoft Sentinel Analytics Rules Administrative Operations
description: |
  'Identifies Microsoft Sentinel Analytics Rules administrative operations'
query: | 
 
  let opValues = dynamic(["Microsoft.SecurityInsights/alertRules/write", "Microsoft.SecurityInsights/alertRules/delete"]);
  // Microsoft Sentinel Analytics - Rule Create / Update / Delete
  AzureActivity
  | where Category == "Administrative"
  | where OperationNameValue in (opValues)
  | where ActivitySubstatusValue in ("Created", "OK")
  | sort by TimeGenerated desc
  | extend timestamp = TimeGenerated, AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPCustomEntity
